{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v2.0.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "sequential_7/conv2d_39/kernel", "shape": [2, 2, 3, 16], "dtype": "float32"}, {"name": "sequential_7/conv2d_39/bias", "shape": [16], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_39/gamma", "shape": [16], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_39/beta", "shape": [16], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_39/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_39/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "sequential_7/conv2d_40/kernel", "shape": [2, 2, 16, 32], "dtype": "float32"}, {"name": "sequential_7/conv2d_40/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_40/gamma", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_40/beta", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_40/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_40/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/conv2d_41/kernel", "shape": [2, 2, 32, 32], "dtype": "float32"}, {"name": "sequential_7/conv2d_41/bias", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_41/gamma", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_41/beta", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_41/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_41/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "sequential_7/conv2d_42/kernel", "shape": [2, 2, 32, 64], "dtype": "float32"}, {"name": "sequential_7/conv2d_42/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_42/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_42/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_42/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_42/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/conv2d_43/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "sequential_7/conv2d_43/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_43/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_43/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_43/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_43/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential_7/conv2d_44/kernel", "shape": [2, 2, 64, 128], "dtype": "float32"}, {"name": "sequential_7/conv2d_44/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_44/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_44/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_44/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential_7/batch_normalization_44/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential_7/dense_21/kernel", "shape": [1536, 1024], "dtype": "float32"}, {"name": "sequential_7/dense_21/bias", "shape": [1024], "dtype": "float32"}, {"name": "sequential_7/dense_22/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "sequential_7/dense_22/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential_7/dense_23/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "sequential_7/dense_23/bias", "shape": [1], "dtype": "float32"}]}]}